## Pandas Nedir, Özellikler

* NumPy'ın alternatifi değildir, NumPy'ın özelliklerini kullanan ve bu özellikleri genişleten bir kütüphanedir.
* NumPy'dan farklı olarak yapay veri setleri ile daha esnek çalışmaya izin veriyor.
* Pandas veri manipülasyonu ve veri analizi için yazılmış açık kaynak kodlu bir kütüphanedir.
* Ekonometrik DataFrame yapısını Python'a getirmiş oldu.

## Pandas Serisi Oluşturmak

* Pandas serisini tek boyutlu array olarak düşünebiliriz.

In [1]:
import pandas as pd

In [2]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

* Yukarıda görülen çıktıda sol taraftaki değerler index bilgisini tutarken, sağ taraftaki değerler ise listenin elemanlarıdır

In [6]:
type(pd.Series([1, 2, 3, 4])) #type bilgisine ulaşıyoruz.

pandas.core.series.Series

In [7]:
pd.Series([1, 2, 3, 4]).axes

[RangeIndex(start=0, stop=4, step=1)]

* Axes komutu ile de serimizin başlangıç, bitiş ve artış değerlerinin bilgilerini alabiliyoruz.

In [8]:
pd.Series([1, 2, 3, 4]).dtype

dtype('int64')

* dtype komutu ile serimizin veri tipi hakkında bilgi verir.

In [10]:
pd.Series([1, 2, 3, 4]).size

4

* size komutu ile serimizin eleman sayısını öğrenebiliriz.

In [12]:
pd.Series([1, 2, 3, 4]).ndim

1

* ndim komutu ile serimizin boyutunu öğrenebiliriz.

In [14]:
pd.Series([1, 2, 3, 4]).values

array([1, 2, 3, 4], dtype=int64)

* values komutu ile serimizin index bilgileri olmadan da sadece değerlerini tutan bir liste gibi gösterebiliriz.

In [16]:
pd.Series([1, 2, 3, 4]).head(2)

0    1
1    2
dtype: int64

* head komutu ile serimizin baştan başlayarak kaç elemanını görmeyi istiyorsak verdiğimiz parametle ile bunu gerçekleştirebiliyoruz.

In [17]:
pd.Series([1, 2, 3, 4]).tail(3)

1    2
2    3
3    4
dtype: int64

* tail komutu ile de head komutunda yaptığımızın tersini yapabiliyoruz, serinin sonundan başlayarak kaç elemana erişmek istiyorsak buna ulaşabiliyoruz.

## Index İsimlendirme

In [19]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

* Yukarıdaki çıktı da indexler default olarak 0'dan başlayarak 1'er artarak devam ediyor, bunu değiştirmek için;

In [20]:
pd.Series([1, 2, 3, 4, 5], index = [10, 12, 14, 16, 18])

10    1
12    2
14    3
16    4
18    5
dtype: int64

* Yukarıda da gördüğümüz gibi index değerlerini el ile girerek istediğimiz değerleri verebiliriz. Index'leri string'ler ile de kullanabiliriz.
* Aynı zamanda indexlemeyi string ile yaparsak sözlük yapısından da kullandığımız key-value çalışmalarını yapabiliriz.

In [22]:
seri = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
seri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [23]:
seri["c"]

3

* Slice işlemlerini de burada kullanabiliriz, örneğin;

In [24]:
seri["b":]

b    2
c    3
d    4
e    5
dtype: int64

In [25]:
seri["a":"c"]

a    1
b    2
c    3
dtype: int64

## Sözlük Üzerinden Seri Oluşturmak

In [28]:
sozluk = {"ad" : "Selman", "soyad" : "Başkaya", "yaş" : 21}
seri =pd.Series(sozluk)
seri

ad        Selman
soyad    Başkaya
yaş           21
dtype: object

## İki Farklı Seriyi Birleştirerek Tek Bir Seri Oluşturma

In [29]:
pd.concat([seri, seri])

ad        Selman
soyad    Başkaya
yaş           21
ad        Selman
soyad    Başkaya
yaş           21
dtype: object

## Eleman İşlemleri

* NumPy üzerinden oluşturulan listeyi pandas serisine çevirmek;

In [30]:
import numpy as np
a = np.array([1, 3, 5, 6, 8])
seri = pd.Series(a)
seri

0    1
1    3
2    5
3    6
4    8
dtype: int32

In [32]:
seri = pd.Series([145, 170, 187, 163], index = ["reg", "loj", "cart", "rf"])
seri

reg     145
loj     170
cart    187
rf      163
dtype: int64

In [33]:
seri.index # komutu ile serinin index bilgisine ulaşabiliriz.

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [34]:
seri.keys # komutu ile serinin key değerlerine ve onlara karşılık gelen value değerlerine erişebiliriz.

<bound method Series.keys of reg     145
loj     170
cart    187
rf      163
dtype: int64>

In [35]:
list(seri.items()) # seri üzerindeki tüm key ve value değerlerini ayrı ayrı görmek istersek bu çevirme işlemine ihtiyacımız olacaktır.

[('reg', 145), ('loj', 170), ('cart', 187), ('rf', 163)]

In [36]:
seri.values # komutu ile serinin value bilgilerine ulaşabilriz.

array([145, 170, 187, 163], dtype=int64)

## Eleman Sorgulama

In [37]:
"reg" in seri # sorgusu ile seri ismindeki seri yapısının içerisinde reg'in olup olmadığını kontrol eder.

True

In [38]:
"regg" in seri

False

## Fancy ile Eleman Seçme

In [39]:
seri[["rf", "cart"]]

rf      163
cart    187
dtype: int64

In [41]:
seri["rf"] = 168 # kod satırı ile rf'nin içerisindeki değeri değiştirebiliriz.
seri["rf"]

168

## Slice ile Eleman Seçme

In [42]:
seri["reg" : "rf"]

reg     145
loj     170
cart    187
rf      168
dtype: int64

## DataFrame Oluşturma

* DataFrame: yapısal bir veri tipidir. excel'e benzer yapıdadır.
* Peki NumPy varken neden bunlara ihtiyaç duyuluyor? 
  
  => NumPy fixed type özelliğe sahiptir, yani içerisinde tek bir veri tipinde değerler tutabilir. Kendi içerisinde kategorik ve sürekli değişkenler ile
     işlemler yapması hiç de kolay değildir. Çok zorlama yöntemler yaparak kullanmak mümkündür. Fakat ileri seviye veri manipülasyonlarına izin veremiyor.

In [47]:
list = [19, 37, 54, 54, 73, 91]
list

[19, 37, 54, 54, 73, 91]

In [48]:
pd.DataFrame(list)

    0
0  19
1  37
2  54
3  54
4  73
5  91

In [49]:
pd.DataFrame(list, columns = ["baslik"]) # columns etiketi ile isimlendirme yapabiliriz.

   baslik
0      19
1      37
2      54
3      54
4      73
5      91

* İki ve daha fazla değişken kullanarak bir DataFrame oluşturmak istersek;

In [50]:
import numpy as np
m = np.arange(1, 10).reshape(3, 3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [52]:
pd.DataFrame(m, columns = ["degisken1", "degisken2", "degisken3"])

   degisken1  degisken2  degisken3
0          1          2          3
1          4          5          6
2          7          8          9

## DataFrame İsimlendirme

In [53]:
df = pd.DataFrame(m, columns = ["degisken1", "degisken2", "degisken3"])
df

   degisken1  degisken2  degisken3
0          1          2          3
1          4          5          6
2          7          8          9

In [56]:
df.columns

Index(['degisken1', 'degisken2', 'degisken3'], dtype='object')

In [58]:
df.columns = ("var1", "var2", "var3")
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [59]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [60]:
type(df) # tip bilgisini döndürür.

pandas.core.frame.DataFrame

In [63]:
df.axes # index bilgisi (satır - sütün) verir.

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [64]:
df.shape # boyut bilgisi verir.

(3, 3)

In [65]:
df.ndim # df'nin boyutunu gösterir, df'ler ile çalışırken bu değer hep 2 çıkacaktır.

2

In [66]:
df.size # eleman sayısı hakkında bilgi verir

9

In [67]:
df.values # bu komut ile df içerisinden sadece value kısmını çekerek bir numpy array'i haline döndürür ve bizlere getirir.

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [68]:
type(df.values) #sadece value kısmını aldığımız için tip olarak numpy array'i bilgisi alırız.

numpy.ndarray

In [69]:
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [70]:
df.tail(1)

   var1  var2  var3
2     7     8     9

## DataFrame Eleman İşlemleri

* 3 tane NumPy array'i oluşturalım ve sözlük yapısı ile bu array'leri birleştirelim;

In [73]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [74]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}
sozluk

{'var1': array([7, 7, 4, 3, 5]),
 'var2': array([9, 0, 8, 4, 8]),
 'var3': array([6, 8, 5, 7, 9])}

* Oluşturduğumuz sözlük yapısını df'ye çevirelim;

In [83]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     7     9     6
1     7     0     8
2     4     8     5
3     3     4     7
4     5     8     9

In [84]:
df[0:3]

   var1  var2  var3
0     7     9     6
1     7     0     8
2     4     8     5

In [86]:
df = pd.DataFrame(sozluk, index = ["a", "b", "c", "d", "e"])
df

   var1  var2  var3
a     7     9     6
b     7     0     8
c     4     8     5
d     3     4     7
e     5     8     9

In [87]:
df["a":"c"]

   var1  var2  var3
a     7     9     6
b     7     0     8
c     4     8     5

* Bu noktada şuna dikkat çekmek istiyorum; index işlemlerini eğer ki default olarak kullanıyorsak 0'dan başlayarak gelecektir, dolayısıyla biz 0:3'e kadar 
  olan kısmı istersek 0, 1 ve 2 geleceği için 3. indiste olanları göremeyiz. **Fakat** string indexleme de bu tarz bir durum olmadığı için a:c'ye kadar 
  dediğimizde a, b ve c gelecektir.

# Index Silme İşlemi

In [88]:
df.drop("a", axis = 0) # axis değeri verme sebebimiz satıra görme silme işlemi yapacağımızı belirtmek içindir.

   var1  var2  var3
b     7     0     8
c     4     8     5
d     3     4     7
e     5     8     9

In [89]:
df

   var1  var2  var3
a     7     9     6
b     7     0     8
c     4     8     5
d     3     4     7
e     5     8     9

* Yukarıdaki çıktıda da gördüğümüz gibi biz "a" satırını drop etmemize rağmen halen daha df'in içerisinde var. Eğer ki "a" satırını kalıcı olarak drop
  etmek istiyorsak inplace = True eklemesini yapmamız gerekiyor;

In [91]:
df.drop("a", axis = 0, inplace = True)

In [92]:
df

   var1  var2  var3
b     7     0     8
c     4     8     5
d     3     4     7
e     5     8     9

* Yeniden atama işlemi yapmadan inplace'i kullanarak yaptığımız değişiklikleri kalıcı hale getirebiliriz.

* df içerisinden tek bir satır değil de birden fazla satır silmek istersek ne yapmalıyız? Burada da devreye **fancy** girmektedir. facny kelime karşılığı
  olarak da fantastik demektir. Şu şekilde bu sorunu çözebiliriz;

In [93]:
l = ["b", "d"]

In [94]:
df.drop(l, axis = 0, inplace = True)

In [95]:
df

   var1  var2  var3
c     4     8     5
e     5     8     9

## Değişkenler ile İşlemler

In [96]:
"var1" in df

True

In [101]:
l = ["var1", "var22", "var3", "var"] # bu iki değişkenin df içerisinde var olup olmadığını sorgulayalım;

In [100]:
for i in l:
    print (i in df)

True
False
True
False

* Var olan df'nin içerisine bir değişken oluşturmak için (var4'ü oluştururken var1 * var3 değeri ile oluşuralım);

In [103]:
df["var4"] = df["var1"] * df["var3"]

In [104]:
df

   var1  var2  var3  var4
c     4     8     5    20
e     5     8     9    45

* Normalde df[] yazdığımız zaman bu yazımdan anlaşılan; df'in içerisine erişileceğidir ama eğer ki df'in içerisine yazılı olan string değişkenler 
  arasında yok ise bu şu şekilde algılanır; yeni değişken olarak ekle.

## Değişken Silme İşlemi

In [106]:
df.drop("var1", axis = 1, inplace = True)

In [107]:
df

   var2  var3  var4
c     8     5    20
e     8     9    45

* fancy ile birden fazla değişkeni tek seferde silme işlemini burada da uygulayabiliriz.

In [108]:
l = ["var2", "var3"]

In [109]:
df.drop(l, axis = 1, inplace = True)

In [110]:
df

   var4
c    20
e    45

## Gözlem ve Değişken Seçimi : loc & iloc

In [1]:
import numpy as np
import pandas as pd

m = np.random.randint(1, 30, size = (10, 3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    13    10    16
1     9    21    29
2     9    11    13
3    21    14    17
4    17     6    24
5    14    26     5
6    19    28    20
7    14    26    23
8    29    22     8
9    21    27    26

* **loc:** tanımlandığı şekliyle seçim yapmak için kullanılır.

In [2]:
df.loc[0:3]

   var1  var2  var3
0    13    10    16
1     9    21    29
2     9    11    13
3    21    14    17

* normalde 3. indisin gelmemesini beklerdik ama loc kullandığımız için 3. index değerleri de gelir.

* **iloc:** alışık olduğumuz indexleme mantığı ile seçim yapar.

In [3]:
df.iloc[0:3]

   var1  var2  var3
0    13    10    16
1     9    21    29
2     9    11    13

* alışık olduğumuz şekilde geldi. 3. indise kadar olan kısımlar geldi.

In [6]:
df.loc[0:4, "var2"]

0    10
1    21
2    11
3    14
4     6
Name: var2, dtype: int32

In [5]:
df.iloc[0:4, "var2"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

* loc ve iloc'un bir farkı da burada karşımızı çıkıyor. loc'da değişkenleri kullanarak işlemler yapabiliyorken bu işlemleri iloc daha farklı şekilde gerçekleştiriyoruz.

In [7]:
df.iloc[0:3]["var2"]

0    10
1    21
2    11
Name: var2, dtype: int32

* yukarıda da görüldüğü üzere değişkeni index seçiminin bitişinden sonra yaparak tekrar değişken seçimi yapabiliyoruz.

In [11]:
df.iloc[0:3, 1:3]

   var2  var3
0    10    16
1    21    29
2    11    13

* yukarıdaki yazım şeklini kullanarak da değişkenleri aktif edebiliriz.

## Koşullu Eleman İşlemleri

In [12]:
m = np.random.randint(1, 20, size = (10, 3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    13    14    17
1    17    15     4
2    13    13     4
3    17    13    18
4    13     4    17
5     3     8     9
6    18    12    11
7    11     2    19
8     9    19     4
9     4     6    14

* var2'de bulunan değerlerin 10'dan büyük olma durumlarını kontrol etmek istersek;

In [16]:
df[df.var2 > 10]["var2"]

0    14
1    15
2    13
3    13
6    12
8    19
Name: var2, dtype: int32

In [25]:
df[(df.var2 > 10) & (df.var3 > 5)]

   var1  var2  var3
0    13    14    17
3    17    13    18
6    18    12    11

In [27]:
df[(df.var1 > 15), ["var1"]]

TypeError: '(0    False
1     True
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
Name: var1, dtype: bool, ['var1'])' is an invalid key

* yukarıdaki şekilde değişkenleri de göstermek istersek kodumuzu loc ifadesini de eklememiz gerekiyor;

In [28]:
df.loc[(df.var1 > 15), ["var1"]]

   var1
1    17
3    17
6    18

## Join İşlemleri

In [31]:
m = np.random.randint(5, 30, size = (5, 3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    12    10     7
1    25    14    24
2    15     9    21
3    29    18    18
4     8    28    28

In [33]:
df1 = df + 10
df1

   var1  var2  var3
0    22    20    17
1    35    24    34
2    25    19    31
3    39    28    28
4    18    38    38

In [34]:
pd.concat([df, df1])

   var1  var2  var3
0    12    10     7
1    25    14    24
2    15     9    21
3    29    18    18
4     8    28    28
0    22    20    17
1    35    24    34
2    25    19    31
3    39    28    28
4    18    38    38

* birleştirme işlemi yapıldı fakat indexlemeye dikkat edecek olursak değerler olduğu gibi kaldı, 4'ten sonra tekrar 0'a dönüyor ve df1'in index değerlerini yazıyor, bundan kurtulmak için ise;

In [37]:
pd.concat([df, df1], ignore_index = True)

   var1  var2  var3
0    12    10     7
1    25    14    24
2    15     9    21
3    29    18    18
4     8    28    28
5    22    20    17
6    35    24    34
7    25    19    31
8    39    28    28
9    18    38    38

* pd.concat ile daha farklı neler yapabilirizin cevabını bulmak için ise;

In [38]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\selman\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [39]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [41]:
df1.columns = ["var1", "var2", "deg3"]
df1

   var1  var2  deg3
0    22    20    17
1    35    24    34
2    25    19    31
3    39    28    28
4    18    38    38

* Şuan da birleştirmek istediğimiz iki veri setimizin değişken adlandırmaları aynı değil, peki ne gibi bir sorunla karşılaşırız?;

In [42]:
pd.concat([df, df1])

   var1  var2  var3  deg3
0    12    10   7.0   NaN
1    25    14  24.0   NaN
2    15     9  21.0   NaN
3    29    18  18.0   NaN
4     8    28  28.0   NaN
0    22    20   NaN  17.0
1    35    24   NaN  34.0
2    25    19   NaN  31.0
3    39    28   NaN  28.0
4    18    38   NaN  38.0

* df veri setinde deg3 değişken değerleri olmadığı için Nan, df1 veri setinde de var3 değişken değerleri olmadığı için Nan ifadeleri ile karşılaştık

* normalde veri setlerinde değişkenler farklı değişkenlere sahip ise farklı işler için değerler tuttuğu düşünülerek birleştirme yapmak çok mantıklı olmaz, fakat biz iki veri setindeki değerlerimizinde aynı işe yaradıklarını düşünüerek bu hatadan kurtulmak istersek;

In [43]:
pd.concat([df, df1], join = "inner")

   var1  var2
0    12    10
1    25    14
2    15     9
3    29    18
4     8    28
0    22    20
1    35    24
2    25    19
3    39    28
4    18    38

* iki veri setinin kesişimine göre bir birleştirme işlemi yapılmış oldu.

In [56]:
pd.concat([df, df1], axis = 1, join = "outer")

   var1  var2  var3  var1  var2  deg3
0    12    10     7    22    20    17
1    25    14    24    35    24    34
2    15     9    21    25    19    31
3    29    18    18    39    28    28
4     8    28    28    18    38    38

## İleri Join İşlemleri

## birebir birleştirme

In [70]:
df1 = pd.DataFrame({'calisanlar' : ["Selman", "Furkan", "Enes", "Kubra"], 
                    'grup' : ["Muhedislik", "Muhasebe", "IT", "IT"]})
df1

  calisanlar        grup
0     Selman  Muhedislik
1     Furkan    Muhasebe
2       Enes          IT
3      Kubra          IT

In [71]:
df2 = pd.DataFrame({"calisanlar" : ["Furkan", "Enes", "Selman", "Kubra"],
                   "ilk_giris" : [2010, 2020, 2019, 2016]})
df2

  calisanlar  ilk_giris
0     Furkan       2010
1       Enes       2020
2     Selman       2019
3      Kubra       2016

In [72]:
pd.merge(df1, df2)

  calisanlar        grup  ilk_giris
0     Selman  Muhedislik       2019
1     Furkan    Muhasebe       2010
2       Enes          IT       2020
3      Kubra          IT       2016

* merge fonksiyonu hangi değişkene göre birleştirme yapacağını kendisi anlıyor ve işlemlerini yapıyor, fakat değişkeni kendimiz belirtmek istersek;

In [73]:
pd.merge(df1, df2, on = "calisanlar")

  calisanlar        grup  ilk_giris
0     Selman  Muhedislik       2019
1     Furkan    Muhasebe       2010
2       Enes          IT       2020
3      Kubra          IT       2016

## çoktan teke birleştirme

In [74]:
df3 = pd.merge(df1, df2)
df3

  calisanlar        grup  ilk_giris
0     Selman  Muhedislik       2019
1     Furkan    Muhasebe       2010
2       Enes          IT       2020
3      Kubra          IT       2016

In [75]:
df4 = pd.DataFrame({"grup" : ["Muhasebe", "IT", "Muhedislik"], 
                  "mudur" : ["Rahmi", "Halil", "Büşra"]})
df4

         grup  mudur
0    Muhasebe  Rahmi
1          IT  Halil
2  Muhedislik  Büşra

In [76]:
pd.merge(df3, df4)

  calisanlar        grup  ilk_giris  mudur
0     Selman  Muhedislik       2019  Büşra
1     Furkan    Muhasebe       2010  Rahmi
2       Enes          IT       2020  Halil
3      Kubra          IT       2016  Halil

* df4'te 3 çıktı df3'te ise 4 çıktı vardı, çoktan teke birleştirme yaparak df3, df4 merge'ü sonunda 4 çıktı aldık

## çoktan çoka birleştirme

In [78]:
df5 = pd.DataFrame({"grup" : ["Muhasebe", "IT", "Muhebdislik", "Muhendislik", "Muhasebe", "IT"], 
                   "yetenekler" : ["mat", "excel", "kodlama", "linux", "excel", "yonetim"]})
df5

          grup yetenekler
0     Muhasebe        mat
1           IT      excel
2  Muhebdislik    kodlama
3  Muhendislik      linux
4     Muhasebe      excel
5           IT    yonetim

In [79]:
df1

  calisanlar        grup
0     Selman  Muhedislik
1     Furkan    Muhasebe
2       Enes          IT
3      Kubra          IT

In [80]:
pd.merge(df1, df5)

  calisanlar      grup yetenekler
0     Furkan  Muhasebe        mat
1     Furkan  Muhasebe      excel
2       Enes        IT      excel
3       Enes        IT    yonetim
4      Kubra        IT      excel
5      Kubra        IT    yonetim